# -*- coding: utf-8 -*-
"""
Created on Mon Sep 21 09:45:08 2020

@author: user1
"""

class patent_field_list():
    patent_type_list = {
                '1':'发明专利',
                '2':'实用新型',
                '3':'外观设计'
            }
    status_list = {
        '1' : '受理',
        '2' : '初审合格',
        '3' : '等待实审请求',
        '4' : '等待实审提案',
        '5' : '等待提案',
        '6' : '新案审查',
        '7' : '初审待答复',
        '8' : '分类待提取',
        '9' : '进入实审',
        '10' : '一通出案待答复',
        '11' : '一通回案实审',
        '12' : '中通出案待答复',
        '13' : '中通回案实审',
        '14' : '其他通知书出案待答复',
        '15' : '其他通知书回案实审',
        '16' : '待质检抽案',
        '17' : '实审检查',
        '18' : '等年登印费',
        '19' : '待公告',
        '20' : '等待颁证公告',
        '21' : '专利权维持',
        '22' : '驳回等复审请求',
        '23' : '驳回失效',
        '24' : '等待合议组成立',
        '25' : '等待合议组审查',
        '26' : '合议组审查',
        '27' : '等待诉讼',
        '28' : '等年费滞纳金',
        '29' : '未缴年费专利权终止，等恢复',
        '30' : '视为放弃，等恢复',
        '31' : '视为未提出',
        '32' : '视为撤回',
        '33' : '专利权终止',
        '34' : '视为放弃取得专利权',
        '35' : '届满终止失效',
        '36' : '无效宣告失败',
    }